/**			                                                    
		   ____                    _____ _______ _____       XTARK@塔克创新
		  / __ \                  / ____|__   __|  __ \ 
		 | |  | |_ __   ___ _ __ | |       | |  | |__) |
		 | |  | | '_ \ / _ \ '_ \| |       | |  |  _  / 
		 | |__| | |_) |  __/ | | | |____   | |  | | \ \ 
		  \____/| .__/ \___|_| |_|\_____|  |_|  |_|  \_\
				| |                                     
				|_|                OpenCTR   机器人控制器
									 
  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __AX_KINEMATICS_H
#define __AX_KINEMATICS_H

/* Includes ------------------------------------------------------------------*/
#include "ax_hal.h"


//机器人运动学解析函数
void AX_ROBOT_Kinematics(void);

//机器人静止函数
void AX_ROBOT_Stop(void);

#endif

/******************* (C) 版权 2023 XTARK **************************************/
